[
  {
    "id": "tempo_envio",
    "active": true,
    "match": { "any_contains": ["quanto tempo", "demora para enviar", "quando envia", "prazo de envio"] },
    "reply": "Oii, tudo bem? As compras feitas hoje, são enviadas amanhã pela manhã, e chegam em média de 3 a 5 dias úteis."
  },
  {
    "id": "quebra_sem_foto",
    "active": true,
    "match": { "any_contains": ["quebrado", "rachado", "defeito", "trincado", "danificado"], "none_contains": ["foto"] },
    "reply": "Oii, espero que esteja bem. Sinto muito por isso! Para que eu possa te ajudar da melhor forma e o mais rápido possível, você poderia me enviar uma foto do item? Assim consigo entender melhor o que aconteceu e buscar a melhor solução para você."
  },
  {
    "id": "quebra_com_foto",
    "active": true,
    "match": { "all_contains": ["quebrado", "foto", "como solicitar", "como faço devolução", "como pedir reembolso", "enviam outro", "enviam outra", "troca urgente", "desesperad"] },
    "reply": "Olá! Sentimos muito pelo ocorrido. Podemos resolver de 3 formas:\n- Reembolso parcial — você fica com o produto e recebe parte do valor de volta.\n- Devolução pelo app da Shopee — com reembolso total após o retorno.\n- Envio de nova peça — sem custo pela peça, você paga apenas o frete, e não precisa devolver nada.\nMe avisa qual opção prefere que resolvo tudo por aqui!"
  },
  {
    "id": "reembolso_parcial",
    "active": true,
    "match": { "any_contains": ["reembolso parcial", "parcial"] },
    "reply": "Olá! Para solicitar o reembolso parcial, siga estes passos:\n1- Acesse Minhas Compras no app da Shopee\n2- Selecione o pedido\n3- Clique em Devolver/Reembolsar\n4- Escolha Reembolso Parcial e adicione fotos e descrição do problema.\nQualquer dúvida, estamos aqui para ajudar!"
  },
  {
    "id": "nova_peca",
    "active": true,
    "match": { "any_contains": ["nova peça", "enviar outra", "pagar frete", "quanto frete"] },
    "reply": "Geralmente o frete sai baratinho, e você consegue usar cupom de frete grátis Shopee, caso tenha. Você pode calcular o frete por este anúncio de R$2,00, e pode fazer a compra dele para receber um trio totalmente novo."
  },
  {
    "id": "devolucao_total",
    "active": true,
    "match": { "any_contains": ["devolução", "reembolso total", "devolver"] },
    "reply": "As devoluções, trocas e reembolsos são feitos pela Shopee. É preciso devolver todo o kit. Para isso, vá até 'A caminho' em 'Minhas compras' > selecione o pedido > clique em 'Pedido de Reembolso'. Em seguida, selecione o motivo, forneça evidências e descrição (se aplicável) e clique em 'Enviar'."
  },
  {
    "id": "faltando_peca",
    "active": true,
    "match": { "any_contains": ["faltou", "faltando", "não veio", "nao veio", "veio faltando", "sem peça", "sem parafuso"] },
    "reply": "Oii, tudo bem? Peço desculpas por isso, posso te enviar a peça que faltou, ou se preferir posso fazer seu reembolso. O que você prefere?"
  },
  {
    "id": "pedido_cancelado",
    "active": true,
    "match": { "any_contains": ["pedido cancelado", "foi cancelado", "cancelaram"] },
    "reply": "Olá! Sinto muito pelo problema na entrega, sei como isso pode ser frustrante. A Shopee Express é responsável por todo o processo, e infelizmente não temos controle sobre o ocorrido. Esses erros também nos prejudicam. Mas não se preocupe! Você pode entrar em contato com o suporte da Shopee pelo app, na seção 'Ajuda'. Enquanto isso, para compensar o transtorno, posso te oferecer um cupom de desconto caso ainda tenha interesse na peça. O que acha?"
  },
  {
    "id": "pedido_parado",
    "active": true,
    "match": { "any_contains": ["pedido parado", "não anda", "não atualiza", "sem movimentação", "ta parado"] },
    "reply": "Sinto muito pelo problema com a entrega, entendo o quanto isso pode ser frustrante. Infelizmente, como a Shopee é responsável pelo envio, não tenho controle direto sobre a situação, mas estou aqui para ajudar no que for possível!\n\nJá abri um chamado reforçando a urgência do seu caso. Além disso, você pode entrar em contato diretamente com o suporte da Shopee pelo app, na seção 'Ajuda'."
  },
  {
    "id": "cilindro_pequeno",
    "active": true,
    "match": { "any_contains": ["cilindro pequeno", "cilindro não é grande", "cilindro errado"] },
    "reply": "Boa tarde! Tudo bem? Poxa, sinto muito pela confusão. Esse anúncio é referente ao trio compacto (3 peças menores), como mostramos na descrição e nas imagens com as medidas. Para alcançar o tamanho padrão, muitos clientes usam 2 trios compactos. Se quiser completar, posso te oferecer 25% de desconto no segundo trio!"
  },
  {
    "id": "pix_pendente",
    "active": true,
    "match": { "any_contains": ["pix", "comprovante", "reembolso nao caiu", "não recebi o pix", "não caiu"] },
    "action": "skip"
  },
  {
    "id": "fallback",
    "active": true,
    "match": { "any_contains": [] },
    "reply": "Desculpe, não entendi muito bem sua mensagem. Você poderia explicar um pouco melhor para que eu consiga te ajudar?"
  },
  {
  "id": "embalagem_segura_precompra",
  "active": true,
  "match": { 
    "any_contains": ["embalado", "embalagem", "amassar", "amassado", "amassam", "avaria", "frágil", "fragil", "quebrar no envio", "bem embalado"],
    "none_contains": ["recebi", "chegou", "veio", "foto", "reembolso", "devolver", "devolução"]
  },
  "reply": "Oii! A gente capricha bastante na embalagem: usamos proteção interna e caixa reforçada para evitar amassar/avarias no transporte. Se acontecer qualquer imprevisto, te ajudamos com a solução pelo app da Shopee (reembolso, troca ou reposição). Pode comprar tranquilo(a) 🙂"
},
  {
  "id": "prazo_entrega_data_especifica",
  "active": true,
  "match": { 
    "any_contains": ["chegue até", "chegar até", "até o dia", "preciso para", "prazo até", "aniversário", "urgente", "final de semana", "data específica"],
    "none_contains": ["recebi", "veio", "chegou"]
  },
  "reply": "Oii! Enviamos no próximo dia útil e o prazo médio é de 3 a 5 dias úteis após a postagem. Por ser logística da Shopee, não consigo prometer uma data exata, mas recomendo finalizar hoje e escolher o frete mais rápido disponível. Assim que postar, te mando o rastreio e acompanho de perto para te ajudar. Pode ser?"
},
  {
  "id": "saudacao_expectativa_positiva",
  "active": true,
  "match": {
    "any_contains": ["ansioso", "espero que venha perfeito", "venha perfeito", "ansiosa", "tomara que venha", "chegue certinho"]
  },
  "reply": "Boa noite! Obrigado pela confiança 🙏 Caprichamos na embalagem (proteção interna + caixa reforçada) e conferimos cada peça antes do envio. Assim que postar, te envio o rastreio. Qualquer coisa, estou aqui! 😊"
},
  {
  "id": "solicita_etiqueta_fragil",
  "active": true,
  "match": { "any_contains": ["frágil", "fragil", "aviso na embalagem", "etiqueta frágil", "danos no transporte", "cuidar no transporte"] },
  "reply": "Claro! Colocamos etiqueta **FRÁGIL** na caixa e reforçamos a proteção interna. A entrega é feita pela Shopee, mas essa sinalização ajuda bastante no manuseio. Pode deixar que já vou marcar aqui 😉"
},
  {
  "id": "duvida_caracteristica_produto",
  "active": true,
  "match": { "any_contains": ["furinho", "furo", "tem furo", "furação", "parafusar", "medida", "tamanho", "material"] },
  "reply": "Ótima pergunta! Alguns modelos já vão com furo, outros podem ser personalizados. Me diz qual modelo/variação você quer e eu te confirmo agora. Se preferir, vejo a opção com/sem furo para você 😉"
}
]

